sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/flsloader_infineon_tricore/src/FlsLoader_Platform.c
/*******************************************************************************
**                                                                            **
** Copyright (C) Infineon Technologies (2013)                                 **
**                                                                            **
** All rights reserved.                                                       **
**                                                                            **
** This document contains proprietary information belonging to Infineon       **
** Technologies. Passing on and copying of this document, and communication   **
** of its contents is not permitted without prior written authorization.      **
**                                                                            **
********************************************************************************
**                                                                           **
**  $FILENAME   : FlsLoader_Platform.c $                                     **
**                                                                           **
**  $CC VERSION : \main\dev_tc23x\23 $                                       **
**                                                                           **
**  $DATE       : 2016-09-29 $                                               **
**                                                                           **
**  AUTHOR      : DL-AUTOSAR-Engineering                                     **
**                                                                           **
**  VENDOR      : Infineon Technologies                                      **
**                                                                           **
**  DESCRIPTION : This file contains AURIX derivative (platform specific)    **
**                functionality of FlsLoader driver.                         **
**                                                                           **
**  MAY BE CHANGED BY USER [yes/no]: No                                      **
**                                                                           **
******************************************************************************/
/*******************************************************************************
**                                                                            **
    TRACEABILITY : [cover parentID=] [/cover]
**                                                                            **
*******************************************************************************/
/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/

/* Inclusion of Tasking sfr file */
#include "IfxFlash_reg.h"
#include "IfxSrc_reg.h"
#include "FlsLoader_Local.h"
/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/
#define FLSLOADER_EEPROM_OFFSETEND      (FLSLOADER_DFLASH_BANK_SIZE - 1U)
#define FLSLOADER_DF_EEPROM_SEGMENT     (0xAF0U)
#define FLSLOADER_DF_UCB_SEGMENT        (0xAF1U)
#define FLSLOADER_EEPROM_SECTOR_SIZE    (0x1FFFU)
#define FLSLOADER_UCB_SECTOR_SIZE_1     (0x3FFU)
#define FLSLOADER_MOD_8                 (0x7U)
#define FLSLOADER_NUM_8                 (0x8U)
#define FLSLOADER_UCB_DATA_SIZE         (0x80U)
#define FLSLOADER_UCB_SECTOR_SIZE       (0x400U)
#define FLSLOADER_UCBSIZE               (0x4000U)
#define FLSLOADER_NUM_OF_UCB_SECTORS    (16U)
#define FLSLOADER_UCB_OFFSETEND         (0x0003FFFU)

#define FLSLOADER_NUM_UCB_SECTORS       (1U)
#define FLSLOADER_NUM_UCB_PAGES         (16U)
#define FLSLOADER_PAGE_SIZE             (8U)
#define FLSLOADER_SHIFT_BY_12           (12U)
#define FLSLOADER_ADDRESS_MASK          ((FlsLoader_AddressType)(0x000FFFFFU))
#define FLSLOADER_DFLASH_SECTOR_SIZE    (0x2000U)

#define FLSLOADER_MAX_SECTORS           ((uint32) 27U)

#define FLASH_HW_MODULE ((volatile Ifx_FLASH *)(void *) &(MODULE_FLASH0))
#define FLASH0_PROCONP ((volatile Ifx_FLASH_PROCONP*)(void *)(&FLASH0_PROCONP0))
#define FLASH0_PROCONOTP \
         ((volatile Ifx_FLASH_PROCONOTP*)(void *)(&FLASH0_PROCONOTP0))
#define FLASH0_PROCONWOP \
         ((volatile Ifx_FLASH_PROCONWOP*)(void *)(&FLASH0_PROCONWOP0))

/*******************************************************************************
**                      Private Constant Definitions                          **
*******************************************************************************/
#define FLSLOADER_START_SEC_CONST_32BIT
#include "MemMap.h"

/* Array of PFlash sector start address offsets. 
   Size of this array has to be the number of sectors in PFx which has 
   maximum number of sectors */
/*IFX_MISRA_RULE_08_07_STATUS=FlsLoader_PFlashSectorOffset is a constant 
  array hence not declared inside the function*/
static const uint32 FlsLoader_PFlashSectorOffset[FLSLOADER_MAX_SECTORS]=
{
  FLSLOADER_PF_S0,
  FLSLOADER_PF_S1,
  FLSLOADER_PF_S2,
  FLSLOADER_PF_S3,
  FLSLOADER_PF_S4,
  FLSLOADER_PF_S5,
  FLSLOADER_PF_S6,
  FLSLOADER_PF_S7,
  FLSLOADER_PF_S8,
  FLSLOADER_PF_S9,
  FLSLOADER_PF_S10,
  FLSLOADER_PF_S11,
  FLSLOADER_PF_S12,
  FLSLOADER_PF_S13,
  FLSLOADER_PF_S14,
  FLSLOADER_PF_S15,
  FLSLOADER_PF_S16,
  FLSLOADER_PF_S17,
  FLSLOADER_PF_S18,
  FLSLOADER_PF_S19,
  FLSLOADER_PF_S20,
  FLSLOADER_PF_S21,
  FLSLOADER_PF_S22,
  FLSLOADER_PF_S23,
  FLSLOADER_PF_S24,
  FLSLOADER_PF_S25,
  FLSLOADER_PF_S26
};

/* UCB_PFLASH Content */
#if ((FLSLOADER_PF0_PROT == WRITE_PROTECTION)||\
     (FLSLOADER_PF0_PROT == READ_PROTECTION))
/* UCB_PFLASH
  page 0 -bytes 0-3: FLASH0_PROCONP0
          bytes 4-7: FLASH0_PROCONP1
  page 1 -bytes 8-11 : all zeroes
          bytes 12-15 : all zeroes
  page 2 -bytes 16-19: copy of FLASH0_PROCONP0
          bytes 20-23: copy of FLASH0_PROCONP1
  page 3 -bytes 24-27 : all zeroes
          bytes 28-31 : all zeroes
  page 4 -bytes 32-39: PW0
  page 5 -bytes 40-47: PW1
  page 6 -bytes 48-55: PW2
  page 7 -bytes 56-63: PW3
  page 8 -bytes 64-71: PW0
  page 9  -bytes 72-79: PW1
  page 10 -bytes 80-87: PW2
  page 11 -bytes 88-95: PW3
  page 12 -bytes 96-103: all zeroes
  page 13 -bytes 104-111: all zeroes
  page 14 -bytes 112-115: confirmation code
           bytes 116-119: zeroes
  page 15 -bytes 120-123: confirmation code
           bytes 124-127: zeroes
*/

  /*IFX_MISRA_RULE_08_07_STATUS=FlsLoader_UcbPFlashPage0 is a constant array 
  hence not declare in the calling function*/
static const uint8 FlsLoader_UcbPFlashPage0[FLSLOADER_UCB_SIZE] =
{
FLSLOADER_PROCONP0_BYTE0,FLSLOADER_PROCONP0_BYTE1,
FLSLOADER_PROCONP0_BYTE2,FLSLOADER_PROCONP0_BYTE3,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
FLSLOADER_PROCONP0_BYTE0,FLSLOADER_PROCONP0_BYTE1,
FLSLOADER_PROCONP0_BYTE2,FLSLOADER_PROCONP0_BYTE3,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
FLSLOADER_P0_PW00_B0,FLSLOADER_P0_PW00_B1,
FLSLOADER_P0_PW00_B2,FLSLOADER_P0_PW00_B3,
FLSLOADER_P0_PW01_B0,FLSLOADER_P0_PW01_B1,
FLSLOADER_P0_PW01_B2,FLSLOADER_P0_PW01_B3,
FLSLOADER_P0_PW10_B0,FLSLOADER_P0_PW10_B1,
FLSLOADER_P0_PW10_B2,FLSLOADER_P0_PW10_B3,
FLSLOADER_P0_PW11_B0,FLSLOADER_P0_PW11_B1,
FLSLOADER_P0_PW11_B2,FLSLOADER_P0_PW11_B3,
FLSLOADER_P0_PW20_B0,FLSLOADER_P0_PW20_B1,
FLSLOADER_P0_PW20_B2,FLSLOADER_P0_PW20_B3,
FLSLOADER_P0_PW21_B0,FLSLOADER_P0_PW21_B1,
FLSLOADER_P0_PW21_B2,FLSLOADER_P0_PW21_B3,
FLSLOADER_P0_PW30_B0,FLSLOADER_P0_PW30_B1,
FLSLOADER_P0_PW30_B2,FLSLOADER_P0_PW30_B3,
FLSLOADER_P0_PW31_B0,FLSLOADER_P0_PW31_B1,
FLSLOADER_P0_PW31_B2,FLSLOADER_P0_PW31_B3,
FLSLOADER_P0_PW00_B0,FLSLOADER_P0_PW00_B1,
FLSLOADER_P0_PW00_B2,FLSLOADER_P0_PW00_B3,
FLSLOADER_P0_PW01_B0,FLSLOADER_P0_PW01_B1,
FLSLOADER_P0_PW01_B2,FLSLOADER_P0_PW01_B3,
FLSLOADER_P0_PW10_B0,FLSLOADER_P0_PW10_B1,
FLSLOADER_P0_PW10_B2,FLSLOADER_P0_PW10_B3,
FLSLOADER_P0_PW11_B0,FLSLOADER_P0_PW11_B1,
FLSLOADER_P0_PW11_B2,FLSLOADER_P0_PW11_B3,
FLSLOADER_P0_PW20_B0,FLSLOADER_P0_PW20_B1,
FLSLOADER_P0_PW20_B2,FLSLOADER_P0_PW20_B3,
FLSLOADER_P0_PW21_B0,FLSLOADER_P0_PW21_B1,
FLSLOADER_P0_PW21_B2,FLSLOADER_P0_PW21_B3,
FLSLOADER_P0_PW30_B0,FLSLOADER_P0_PW30_B1,
FLSLOADER_P0_PW30_B2,FLSLOADER_P0_PW30_B3,
FLSLOADER_P0_PW31_B0,FLSLOADER_P0_PW31_B1,
FLSLOADER_P0_PW31_B2,FLSLOADER_P0_PW31_B3,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
FLSLOADER_CONFIRMATION_CODE_B0,FLSLOADER_CONFIRMATION_CODE_B1,
FLSLOADER_CONFIRMATION_CODE_B2,FLSLOADER_CONFIRMATION_CODE_B3,
0x00U,0x00U,0x00U,0x00U,
FLSLOADER_CONFIRMATION_CODE_B0,FLSLOADER_CONFIRMATION_CODE_B1,
FLSLOADER_CONFIRMATION_CODE_B2,FLSLOADER_CONFIRMATION_CODE_B3,
0x00U,0x00U,0x00U,0x00U
};
#endif
  /*#if ((FLSLOADER_PF0_PROT == WRITE_PROTECTION)||...*/

  /* UCB_DFLASH Content */
#if (FLSLOADER_DF0_PROT != NO_PROTECTION)
  /* UCB_DFLASH
  page 0 -bytes 0-3: PROCOND
          bytes 4-7: all zeroes
  page 1 -bytes 8-11 : all zeroes
          bytes 12-15 : all zeroes
  page 2 -bytes 16-19: copy of PROCOND
          bytes 20-23: all zeroes
  page 3 -bytes 24-27 : all zeroes
          bytes 28-31 : all zeroes
  page 4 -bytes 32-39: PW0
  page 5 -bytes 40-47: PW1
  page 6 -bytes 48-55: PW2
  page 7 -bytes 56-63: PW3
  page 8 -bytes 64-71: PW0
  page 9  -bytes 72-79: PW1
  page 10 -bytes 80-87: PW2
  page 11 -bytes 88-95: PW3
  page 12 -bytes 96-103: all zeroes
  page 13 -bytes 104-111: all zeroes
  page 14 -bytes 112-115: confirmation code
           bytes 116-119: zeroes
  page 15 -bytes 120-123: confirmation code
           bytes 124-127: zeroes*/

