sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/flsloader_infineon_tricore/src/FlsLoader_Platform.c
  /*IFX_MISRA_RULE_08_07_STATUS=lsLoader_UcbDFlashPage0 is a constant array 
  hence not declare in the calling function*/
static const uint8 FlsLoader_UcbDFlashPage0[FLSLOADER_UCB_SIZE] = {
FLSLOADER_PROCOND_BYTE0,FLSLOADER_PROCOND_BYTE1,
FLSLOADER_PROCOND_BYTE2,FLSLOADER_PROCOND_BYTE3,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
FLSLOADER_PROCOND_BYTE0,FLSLOADER_PROCOND_BYTE1,
FLSLOADER_PROCOND_BYTE2,FLSLOADER_PROCOND_BYTE3,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
FLSLOADER_DF0_PW00_B0,FLSLOADER_DF0_PW00_B1,
FLSLOADER_DF0_PW00_B2,FLSLOADER_DF0_PW00_B3,
FLSLOADER_DF0_PW01_B0,FLSLOADER_DF0_PW01_B1,
FLSLOADER_DF0_PW01_B2,FLSLOADER_DF0_PW01_B3,
FLSLOADER_DF0_PW10_B0,FLSLOADER_DF0_PW10_B1,
FLSLOADER_DF0_PW10_B2,FLSLOADER_DF0_PW10_B3,
FLSLOADER_DF0_PW11_B0,FLSLOADER_DF0_PW11_B1,
FLSLOADER_DF0_PW11_B2,FLSLOADER_DF0_PW11_B3,
FLSLOADER_DF0_PW20_B0,FLSLOADER_DF0_PW20_B1,
FLSLOADER_DF0_PW20_B2,FLSLOADER_DF0_PW20_B3,
FLSLOADER_DF0_PW21_B0,FLSLOADER_DF0_PW21_B1,
FLSLOADER_DF0_PW21_B2,FLSLOADER_DF0_PW21_B3,
FLSLOADER_DF0_PW30_B0,FLSLOADER_DF0_PW30_B1,
FLSLOADER_DF0_PW30_B2,FLSLOADER_DF0_PW30_B3,
FLSLOADER_DF0_PW31_B0,FLSLOADER_DF0_PW31_B1,
FLSLOADER_DF0_PW31_B2,FLSLOADER_DF0_PW31_B3,
FLSLOADER_DF0_PW00_B0,FLSLOADER_DF0_PW00_B1,
FLSLOADER_DF0_PW00_B2,FLSLOADER_DF0_PW00_B3,
FLSLOADER_DF0_PW01_B0,FLSLOADER_DF0_PW01_B1,
FLSLOADER_DF0_PW01_B2,FLSLOADER_DF0_PW01_B3,
FLSLOADER_DF0_PW10_B0,FLSLOADER_DF0_PW10_B1,
FLSLOADER_DF0_PW10_B2,FLSLOADER_DF0_PW10_B3,
FLSLOADER_DF0_PW11_B0,FLSLOADER_DF0_PW11_B1,
FLSLOADER_DF0_PW11_B2,FLSLOADER_DF0_PW11_B3,
FLSLOADER_DF0_PW20_B0,FLSLOADER_DF0_PW20_B1,
FLSLOADER_DF0_PW20_B2,FLSLOADER_DF0_PW20_B3,
FLSLOADER_DF0_PW21_B0,FLSLOADER_DF0_PW21_B1,
FLSLOADER_DF0_PW21_B2,FLSLOADER_DF0_PW21_B3,
FLSLOADER_DF0_PW30_B0,FLSLOADER_DF0_PW30_B1,
FLSLOADER_DF0_PW30_B2,FLSLOADER_DF0_PW30_B3,
FLSLOADER_DF0_PW31_B0,FLSLOADER_DF0_PW31_B1,
FLSLOADER_DF0_PW31_B2,FLSLOADER_DF0_PW31_B3,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
FLSLOADER_CONFIRMATION_CODE_B0,FLSLOADER_CONFIRMATION_CODE_B1,
FLSLOADER_CONFIRMATION_CODE_B2,FLSLOADER_CONFIRMATION_CODE_B3,
0x00U,0x00U,0x00U,0x00U,
FLSLOADER_CONFIRMATION_CODE_B0,FLSLOADER_CONFIRMATION_CODE_B1,
FLSLOADER_CONFIRMATION_CODE_B2,FLSLOADER_CONFIRMATION_CODE_B3,
0x00U,0x00U,0x00U,0x00U
};
#endif
  /*#if (FLSLOADER_PF0_PROT != NO_PROTECTION)*/

  /* UCB OTP FLASH content */
#if ((FLSLOADER_PF0_PROT == OTP_PROTECTION)||\
     (FLSLOADER_PF0_PROT == WOP_PROTECTION))
/* UCB_OTP
  page 0 -bytes 0-3: PROCONOTP0
          bytes 4-7: PROCONOTP1
  page 1 -bytes 8-15 : all zeroes
  page 2 -bytes 16-19: copy of PROCONOTP0
          bytes 20-23: copy of PROCONOTP1
  page 3 -bytes 24-31 : all zeroes
  page 4 -bytes 32-35: PROCONWOP0
          bytes 36-39: PROCONWOP1
  page 5  -bytes 40-47: all zeroes
  page 6  -bytes 48-51: copy of PROCONWOP0
  page    -bytes 52-55: copy of ROCONWOP1
  page 7   -bytes 56-63: all zeroes
  page 8   -bytes 64-71: all zeroes
  page 9  -bytes 72-79: all zeroes
  page 10  -bytes 80-87: all zeroes
  page 11  -bytes 88-95: all zeroes
  page 12  -bytes 96-103: all zeroes
  page 13  -bytes 104-111 : all zeroes
  page 14   bytes 112-115: confirmation code
           -bytes 116-119: all zeroes
  page 15  -bytes 120-123: copy of confirmation code
            bytes 124-127: all zeroes
*/

  /*IFX_MISRA_RULE_08_07_STATUS=lsLoader_UcbOTPPFlashPage0 is a constant array 
  hence not declare in the calling function*/
static const uint8 FlsLoader_UcbOTPFlashPage0[FLSLOADER_UCB_SIZE] = {
FLSLOADER_PROCONOTP0_BYTE0,FLSLOADER_PROCONOTP0_BYTE1,
FLSLOADER_PROCONOTP0_BYTE2,FLSLOADER_PROCONOTP0_BYTE3,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,
FLSLOADER_PROCONOTP0_BYTE0,FLSLOADER_PROCONOTP0_BYTE1,
FLSLOADER_PROCONOTP0_BYTE2,FLSLOADER_PROCONOTP0_BYTE3,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,
FLSLOADER_PROCONWOP0_BYTE0,FLSLOADER_PROCONWOP0_BYTE1,
FLSLOADER_PROCONWOP0_BYTE2,FLSLOADER_PROCONWOP0_BYTE3,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,
FLSLOADER_PROCONWOP0_BYTE0,FLSLOADER_PROCONWOP0_BYTE1,
FLSLOADER_PROCONWOP0_BYTE2,FLSLOADER_PROCONWOP0_BYTE3,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,0x00U,
FLSLOADER_CONFIRMATION_CODE_B0,FLSLOADER_CONFIRMATION_CODE_B1,
FLSLOADER_CONFIRMATION_CODE_B2,FLSLOADER_CONFIRMATION_CODE_B3,
0x00U,0x00U,0x00U,0x00U,
FLSLOADER_CONFIRMATION_CODE_B0,FLSLOADER_CONFIRMATION_CODE_B1,
FLSLOADER_CONFIRMATION_CODE_B2,FLSLOADER_CONFIRMATION_CODE_B3,
0x00U,0x00U,0x00U,0x00U};

#endif
/*  #if ((FLSLOADER_PF0_PROT == OTP_PROTECTION)...*/

#define FLSLOADER_STOP_SEC_CONST_32BIT
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*******************************************************************************
**                    Prototypes Of Local Functions                           **
*******************************************************************************/
#define FLSLOADER_START_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"
#if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
  /*
  Function FlsLoader_lAddressPageCheck
  Input Parameters: TargetAddress
  */
IFX_LOCAL_INLINE uint8 FlsLoader_lAddressPageCheck(
                                         FlsLoader_AddressType TargetAddress);
  /*
  Function FlsLoader_lDFlashCheck
  Input Parameters: TargetAddress
  */
IFX_LOCAL_INLINE boolean FlsLoader_lDFlashCheck(
                                     FlsLoader_AddressType TargetAddress);
  /*
  Function FlsLoader_lDFlashAddressCheck
  Input Parameters: TargetAddress
  */
IFX_LOCAL_INLINE uint8 FlsLoader_lDFlashAddressCheck(
                                           FlsLoader_AddressType TargetAddress);
  /*
  Function FlsLoader_lDFlashLengthCheck
  Input Parameters: TargetAddress,Length
  */
IFX_LOCAL_INLINE uint8 FlsLoader_lDFlashLengthCheck(
               FlsLoader_LengthType Length,FlsLoader_AddressType TargetAddress);
    /*
  Function FlsLoader_lPFlashCheck
  Input Parameters: TargetAddress
  */
IFX_LOCAL_INLINE boolean FlsLoader_lPFlashCheck(
                                     FlsLoader_AddressType TargetAddress);
  /*
  Function FlsLoader_lPFlashAddressCheck
  Input Parameters: TargetAddress
  */
IFX_LOCAL_INLINE uint8 FlsLoader_lPFlashAddressCheck(
                                           FlsLoader_AddressType TargetAddress);
  /*
  Function FlsLoader_lDFlashPageCheck
  Input Parameters: TargetAddress,Length
  */
IFX_LOCAL_INLINE boolean FlsLoader_lDFlashPageCheck(
             FlsLoader_AddressType TargetAddress,FlsLoader_LengthType Length);
#endif

#if (FLSLOADER_ENABLE_LOCKCHECK == STD_ON)
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lPFlashSectorCheck (
                                    FlsLoader_AddressType TargetAddress,
                                    FlsLoader_LengthType Length);

