sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/flsloader_infineon_tricore/src/FlsLoader_Platform.c
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lCheckSectorProt(
                                    uint32 TargetAddress,
                                    FlsLoader_LengthType Length);

IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lSectorProtCheck(
                                    uint32 SectorNumber,
                                    FlsLoader_LengthType Length );

#endif
#define FLSLOADER_STOP_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

#define FLSLOADER_START_SEC_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

#if (FLSLOADER_LOCK_UNLOCK_API == STD_ON)
IFX_LOCAL_INLINE FlsLoader_ReturnType  FlsLoader_lLockCmdCycles(
                        FlsLoader_AddressType StartAddress,
                        FlsLoader_AddressType UcbSectorAddress,
                        const FlsLoader_AddressType *PdataPtr);

IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lLockCmdCyclesWrite(
                        FlsLoader_AddressType StartAddress,
                        FlsLoader_AddressType UcbSectorAddress,
                        const FlsLoader_AddressType *PdataPtr);
#endif

IFX_LOCAL_INLINE uint32 FlsLoader_lSectorNumber(uint32 Offset);
#define FLSLOADER_STOP_SEC_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"
/******************************************************************************
**                      Private Variable Definitions                         **
******************************************************************************/
#ifdef IFX_FLSLOADER_DEBUG
  #define FLSLOADER_START_SEC_VAR_32BIT
  #include "MemMap.h"
    extern volatile uint32 TestFlsloader_DebugMask00;
    extern volatile uint32 TestFlsloader_DebugMask01;
    extern volatile uint32 TestFlsloader_DebugMask03;
    extern volatile uint32 TestFlsloader_DebugMask09;
    extern volatile uint32 TestFlsloader_DebugMask06;
    extern volatile uint32 TestFlsloader_DebugMask08;
    extern volatile uint32 TestFlsloader_DebugMask10;
    extern volatile uint32 TestFlsloader_DebugMask07;
    extern volatile uint32 TestFlsloader_DebugMask11;
    extern volatile uint32 TestFlsloader_DebugMask12;
    extern volatile uint32 TestFlsloader_DebugMask13;
    extern volatile uint32 TestFlsloader_DebugMask14;
    extern volatile uint32 TestFlsloader_DebugMask15;
  #define FLSLOADER_STOP_SEC_VAR_32BIT
  #include "MemMap.h"
#endif

/*******************************************************************************
**                      Global Function Definitions                           **
*******************************************************************************/

#define FLSLOADER_START_SEC_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

#if (FLSLOADER_LOCK_UNLOCK_API == STD_ON)
/*******************************************************************************
** Syntax           : FlsLoader_ReturnType FlsLoader_lLock(void)              **
**                                                                            **
** Service ID       :   NA                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters (in)  : none                                                    **
**                                                                            **
** Parameters (out) :                                                         **
** Return value     : FlsLoader_ReturnType                                    **
**                                                                            **
** Description      : This function Locks the required profile and called     **
**                    from Lock API.                                          **
**                                                                            **
*******************************************************************************/
FlsLoader_ReturnType FlsLoader_lLock(void)
{
  FlsLoader_ReturnType RetError;
  #if (FLSLOADER_DF0_PROT != NO_PROTECTION)
  FlsLoader_ReturnType RetErrorDF;
  #endif
  
  #if ((FLSLOADER_DF0_PROT != NO_PROTECTION) ||\
       (FLSLOADER_PF0_PROT != NO_PROTECTION))  
  FlsLoader_AddressType StartAddress;
  FlsLoader_AddressType UcbSectorAddress;
  const FlsLoader_AddressType *PdataPtr ;
  StartAddress = FLSLOADER_DFLASH0_START_ADDRESS;
  #endif  
  
  #if ((FLSLOADER_DF0_PROT == NO_PROTECTION) &&\
       (FLSLOADER_PF0_PROT == NO_PROTECTION))
  RetError = FLSLOADER_E_OK;
  #else
  #if ((FLSLOADER_PF0_PROT == WRITE_PROTECTION)||\
       (FLSLOADER_PF0_PROT == READ_PROTECTION))
  UcbSectorAddress = FLSLOADER_UCB_PFLASH;
  /*IFX_MISRA_RULE_11_05_STATUS="FlsLoader_UcbPFlashPage0" attempt to cast away
  const in terms of pointer access.*/
  PdataPtr = (FlsLoader_AddressType *)(void*)(&FlsLoader_UcbPFlashPage0[0]);
  RetError = FlsLoader_lLockCmdCycles(StartAddress,UcbSectorAddress,PdataPtr);
  #elif ((FLSLOADER_PF0_PROT == OTP_PROTECTION)||\
         (FLSLOADER_PF0_PROT == WOP_PROTECTION))
  UcbSectorAddress = FLSLOADER_UCB_OTP;
  /*IFX_MISRA_RULE_11_05_STATUS="FlsLoader_UcbOTPFlashPage0" attempt to 
  cast away const in terms of pointer access.*/
  PdataPtr = (FlsLoader_AddressType *)(void*)(&FlsLoader_UcbOTPFlashPage0[0]);
  RetError = FlsLoader_lLockCmdCycles(StartAddress,UcbSectorAddress,PdataPtr);
  #endif
  #if (FLSLOADER_DF0_PROT != NO_PROTECTION)
  UcbSectorAddress = FLSLOADER_UCB_DFLASH;
  /*IFX_MISRA_RULE_11_05_STATUS="FlsLoader_UcbDFlashPage0" attempt to cast away
  const in terms of pointer access.*/
  PdataPtr = (FlsLoader_AddressType *)((void*)FlsLoader_UcbDFlashPage0);
  RetErrorDF = FlsLoader_lLockCmdCycles(StartAddress,UcbSectorAddress,PdataPtr);
  #if (FLSLOADER_PF0_PROT != NO_PROTECTION)
  if(RetError == FLSLOADER_E_OK)
  #endif
  {
    RetError = RetErrorDF;
  }
  #endif
  #endif
  return RetError;
}

