sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/flsloader_infineon_tricore/src/FlsLoader_Platform.c
/*******************************************************************************
** Syntax   :  IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lLockCmdCycles(**
**                        FlsLoader_AddressType TargetAddress ,               **
**                        FlsLoader_AddressType UcbSectorAddress,             **
**                        FlashLoader_DataType* PdataPtr                      **
**                    )                                                       **
**                                                                            **
** Service ID       :   NA                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters (in)  : none                                                    **
**                                                                            **
** Parameters (out) :                                                         **
** Return value     : FlsLoader_ReturnType                                    **
**                                                                            **
** Description      : This function Locks the required profile and called     **
**                    from Lock  API.                                         **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lLockCmdCycles(
                         FlsLoader_AddressType StartAddress,
                         FlsLoader_AddressType UcbSectorAddress,
                         const FlsLoader_AddressType *PdataPtr)
{
  FlsLoader_ReturnType  RetError;
  volatile uint32       BusyCheck;
  uint32                InnerCount;
  uint32                Icr;
  volatile uint32       FlashFsr;
  
  #if ((FLSLOADER_PF0_PROT == OTP_PROTECTION)||\
       (FLSLOADER_PF0_PROT == WOP_PROTECTION))
  uint32 LoopCount;
  #endif

  /* Enter Critical Section */
  Icr = FlsLoader_lDisableInts();

  #ifndef IFX_FLSLOADER_DEBUG
  /* Erase the corresponding User Configuraiton Block */
  /* cycle 1 */
  /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
  volatile uint32 to avoid compiler optimization in command cycles*/
  /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to uint32 for address
  comparison/calculation purpose.*/
  /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to uint32 for address
  comparison/calculation purpose.*/
  *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AA50(StartAddress))  = 
                                                             UcbSectorAddress;
  /* cycle 2 */
  /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
  volatile uint32 to avoid compiler optimization in command cycles*/
  /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to uint32 for address
  comparison/calculation purpose.*/
  /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to uint32 for address
  comparison/calculation purpose.*/
  *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AA58(StartAddress))  = 
                                                    FLSLOADER_NUM_UCB_SECTORS;
  /* cycle 3 */
  /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
  volatile uint32 to avoid compiler optimization in command cycles*/
  /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to uint32 for address
  comparison/calculation purpose.*/
  /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to uint32 for address
  comparison/calculation purpose.*/
  *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AAA8(StartAddress))  = 
                                                           FLSLOADER_VALUE_80;
  /* cycle 4 */
  /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
  volatile uint32 to avoid compiler optimization in command cycles*/
  /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to uint32 for address
  comparison/calculation purpose.*/
  /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to uint32 for address
  comparison/calculation purpose.*/
  *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AAA8(StartAddress))  = 
                                                           FLSLOADER_VALUE_50;
  #endif
  InnerCount = 0U;

  #ifdef  IFX_FLSLOADER_DEBUG
  FlashFsr =  TestFlsloader_DebugMask12;
  #else
  FlashFsr = FLASH0_FSR.B.ERASE;
  #endif

  while((FlashFsr != FLSLOADER_BIT_SET) &&
       (InnerCount < FLSLOADER_CMDCYCLE_TIMEOUT))
  {
    InnerCount++;
    #ifdef  IFX_FLSLOADER_DEBUG
    FlashFsr =  TestFlsloader_DebugMask12;
    #else
    FlashFsr = FLASH0_FSR.B.ERASE;
    #endif   
  }

  if(InnerCount < FLSLOADER_CMDCYCLE_TIMEOUT)
  {
    /* Check for FLASH BUSY flag */
    /* PnBUSY and D0BUSY */
    InnerCount = 0U;
    #ifdef  IFX_FLSLOADER_DEBUG
    BusyCheck =  TestFlsloader_DebugMask03;
    #else
    BusyCheck = (FLASH0_FSR.U & (uint32)FLSLOADER_NUM_2);
    #endif
    while(( BusyCheck != 0U) && 
          (InnerCount < FLSLOADER_BUSY_TIMEOUT))
    {
      InnerCount++;
      #ifdef  IFX_FLSLOADER_DEBUG
      BusyCheck = TestFlsloader_DebugMask03;
      #else
      BusyCheck = (FLASH0_FSR.U & (uint32)FLSLOADER_NUM_2);
      #endif
    }
    if (InnerCount < FLSLOADER_BUSY_TIMEOUT )
    {
      /* This check makes sure that  erase operation is requested,
      No protection error and no sequence error has occurred. */
      
      /* This check makes sure No protection error and no sequence error
      and No operation error has occurred.*/
      #ifdef IFX_FLSLOADER_DEBUG
      RetError = TestFlsloader_DebugMask13;
      #else
      RetError = FlsLoader_lProtSeqOperErrorCheck();
      #endif
    }
    else
    {
      RetError = FLSLOADER_E_NOT_OK;
    }
  }
  else
  {
    RetError = FLSLOADER_E_NOT_OK;
  }
  /* Clear the status if the operation is successful.*/
  /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
  volatile uint32 to avoid compiler optimization in command cycles*/
  /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to uint32 for address
  comparison/calculation purpose.*/
  /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to uint32 for address
  comparison/calculation purpose.*/
   *((FlsLoader_AddressType*)FlsLoader_lClearStatus(StartAddress)) = 
                                                           FLSLOADER_VALUE_FA;

  /* Enter Critical Section */
  FlsLoader_lEnableInts(Icr);

  /* Erase is completed now program 16 pages of UCB in Page mode. */

  /* Enter Critical Section */
  Icr = FlsLoader_lDisableInts();

  #if ((FLSLOADER_PF0_PROT == OTP_PROTECTION)||\
      (FLSLOADER_PF0_PROT == WOP_PROTECTION))
  /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
  volatile uint32 to avoid compiler optimization in command cycles*/
  if(UcbSectorAddress == FLSLOADER_UCB_OTP)
  {
    for(LoopCount = 0U;
        (LoopCount < FLSLOADER_NUM_8);
        LoopCount++)
    {
      if (RetError == FLSLOADER_E_OK)
      {
        RetError = FlsLoader_lLockCmdCyclesWrite(StartAddress,
                         UcbSectorAddress,PdataPtr);
        UcbSectorAddress+=FLSLOADER_UCB_DATA_SIZE;
      }
    }
  }
  else 
  #endif
  {
    if (RetError == FLSLOADER_E_OK)
    {
      RetError = FlsLoader_lLockCmdCyclesWrite(StartAddress,
                       UcbSectorAddress,PdataPtr);
    }
  }

  /* Exit Crtical Section */
  FlsLoader_lEnableInts(Icr);

  return(RetError);
}
/*******************************************************************************
** Syntax   :  IFX_LOCAL_INLINE FlsLoader_ReturnType                          **
**                                FlsLoader_lLockCmdCyclesWrite(              **
**                                FlsLoader_AddressType TargetAddress ,       **
**                                FlsLoader_AddressType UcbSectorAddress,     **
**                                const FlashLoader_DataType* PdataPtr        **
**                                )                                           **
**                                                                            **
** Service ID       :   NA                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters (in)  : none                                                    **
**                                                                            **
** Parameters (out) :                                                         **
** Return value     : FlsLoader_ReturnType                                    **
**                                                                            **
** Description      : This function Locks the required profile and called     **
**                    from Lock  API.                                         **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lLockCmdCyclesWrite(
                         FlsLoader_AddressType StartAddress,
                         FlsLoader_AddressType UcbSectorAddress,
                         const FlsLoader_AddressType *PdataPtr)
{
  FlsLoader_ReturnType      RetError;
  uint32                    Count;
  uint32                    InCount;
  volatile uint32           FlashBusyStat;
  volatile uint32         BusyCheck;
  FlsLoader_AddressType    *LoadPageAddress;
  RetError = FLSLOADER_E_OK;
  
  for (Count = 0U; 
      (Count < FLSLOADER_NUM_UCB_PAGES) && (RetError == FLSLOADER_E_OK);
       Count++)
  {
    /* Enter the Page Mode */
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
    volatile uint32 to avoid compiler optimization in command cycles*/
    /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to uint32 for 
    address comparison/calculation purpose.*/
    /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to uint32 for 
    address comparison/calculation purpose.*/
    *((FlsLoader_AddressType*)FlsLoader_lEnterPageMode(StartAddress)) =
                                             FLSLOADER_DFLASH_VAL;
    InCount = 0U;
    #ifdef  IFX_FLSLOADER_DEBUG
    FlashBusyStat =  TestFlsloader_DebugMask08;
    #else
    FlashBusyStat = FLASH0_FSR.B.DFPAGE;
    #endif
    /* Check if Program Flash is in page mode */
    while((FlashBusyStat != FLSLOADER_BIT_SET) && 
         (InCount < FLSLOADER_CMDCYCLE_TIMEOUT))
    {
      InCount++;
      #ifdef  IFX_FLSLOADER_DEBUG
      FlashBusyStat =  TestFlsloader_DebugMask08;
      #else
      FlashBusyStat = FLASH0_FSR.B.DFPAGE;
      #endif
    }
    /* Check PFPAGE/DFPAGE bit was SET */
    if(InCount < FLSLOADER_CMDCYCLE_TIMEOUT)
    {
      /* Load the data */
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
      type volatile uint32 to avoid compiler optimization in command 
      cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to uint32 
      for address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to uint32 
      for address comparison/calculation purpose.*/
      LoadPageAddress = 
              (FlsLoader_AddressType *)FlsLoader_lLoadPage(StartAddress);
      *LoadPageAddress = *PdataPtr;
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used to load 
      data into address and is within allowed range*/
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used to load 
      data into address and is within allowed range*/
      *(LoadPageAddress + 1U) = *(PdataPtr + 1U);
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used to load 
      data into address and is within allowed range*/
      PdataPtr += FLSLOADER_NUM_2;
      /* Load Page register gets incremented automatically. */
      /* cycle 1 */
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
      type volatile uint32 to avoid compiler optimization in 
      command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to uint32 
      for address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to uint32 
      for address comparison/calculation purpose.*/
      *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AA50(StartAddress))
                                    = UcbSectorAddress;
      /* cycle 2 */
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
      type volatile uint32 to avoid compiler optimization in 
      command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to uint32 
      for address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to uint32 
      for address comparison/calculation purpose.*/
      *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AA58(StartAddress))
                                    =  FLSLOADER_VALUE_00;
      /* cycle 3 */
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
      type volatile uint32 to avoid compiler optimization in 
      command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to uint32 
      for address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to uint32 
      for address comparison/calculation purpose.*/
        *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AAA8(StartAddress))
                                    =  FLSLOADER_VALUE_A0;
      /*cycle 4 */
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
      type volatile uint32 to avoid compiler optimization in 
      command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to uint32 
      for address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to uint32 
      for address comparison/calculation purpose.*/
      *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AAA8(StartAddress))
                                    = FLSLOADER_VALUE_AA;
      
      InCount = 0U;
      #ifdef  IFX_FLSLOADER_DEBUG
      FlashBusyStat =  TestFlsloader_DebugMask14;
      #else
      FlashBusyStat = FLASH0_FSR.B.PROG;
      #endif
      while((FlashBusyStat != FLSLOADER_BIT_SET) &&
            (InCount < FLSLOADER_CMDCYCLE_TIMEOUT))
      {
        InCount++;
        #ifdef  IFX_FLSLOADER_DEBUG
        FlashBusyStat =  TestFlsloader_DebugMask14;
        #else
        FlashBusyStat = FLASH0_FSR.B.PROG;
        #endif
      }
      if (InCount < FLSLOADER_CMDCYCLE_TIMEOUT)
      {
        /* Check for FLASH BUSY flag */
        InCount = 0U;
        #ifdef  IFX_FLSLOADER_DEBUG
        BusyCheck = TestFlsloader_DebugMask15;
        #else
        BusyCheck = (FLASH0_FSR.U & (uint32)FLSLOADER_NUM_2);
        #endif
        while((BusyCheck != 0U)&& 
             (InCount < FLSLOADER_BUSY_TIMEOUT))
        {
          InCount++;
          #ifdef IFX_FLSLOADER_DEBUG
          BusyCheck = TestFlsloader_DebugMask15;
          #else
          BusyCheck = (FLASH0_FSR.U & (uint32)FLSLOADER_NUM_2);
          #endif
        }
        if (InCount < FLSLOADER_BUSY_TIMEOUT )
        {
        /* This check makes sure No protection error and no sequence error
        and No operation error has occurred.*/
        #ifdef IFX_FLSLOADER_DEBUG
        RetError = TestFlsloader_DebugMask14;
        #else
        RetError = FlsLoader_lProtSeqOperErrorCheck();
        #endif
        }
        else
        {
          RetError = FLSLOADER_E_NOT_OK;
        }
      }
      else
      {
        RetError = FLSLOADER_E_NOT_OK;
      }
      /* Clear the status if the operation is successful.*/
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined 
      of type volatile uint32 to avoid compiler optimization in 
      command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS=The Pointers are type-cast to 
      uint32 for address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS=The Pointers are type-cast to 
      uint32 for address comparison/calculation purpose.*/
      *((FlsLoader_AddressType*)FlsLoader_lClearStatus(StartAddress))
                                    =  FLSLOADER_VALUE_FA;

      /* Iterate the TargetAddress to the next page Address */
      UcbSectorAddress = UcbSectorAddress + FLSLOADER_PAGE_SIZE;
    }  /* End of InCount < FLSLOADER_CMDCYCLE_TIMEOUT*/
    else
    {
      RetError = FLSLOADER_E_NOT_OK;
    }  
  }  /* End of For Loop */
  return(RetError);
}
#endif
  /* #if (FLSLOADER_LOCK_UNLOCK_API == STD_ON)*/

