sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/flsloader_infineon_tricore/src/FlsLoader_Platform.c
/*******************************************************************************
** Syntax :           FlsLoader_ReturnType FlsLoader_lCheckOTPWOP(void)       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : none                                                    **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : FLSLOADER_E_OK                                          **
**                    FLSLOADER_E_ROMVERSION                                  **
**                                                                            **
** Description      : This function checks whether all the sectors have been  **
**                    protected under OTP and WOP                             **
*******************************************************************************/
FlsLoader_ReturnType FlsLoader_lCheckOTPWOP(void)
{
  FlsLoader_ReturnType  RetError;
  uint32                Fls0Check;
  uint32                Fls0WOPCheck;
  RetError = FLSLOADER_E_OK;

  #ifdef IFX_FLSLOADER_DEBUG
  Fls0Check = TestFlsloader_DebugMask00;
  Fls0WOPCheck = TestFlsloader_DebugMask00;
  #else
  Fls0Check = (uint32)(FLASH0_PROCONOTP0.U & FLSLOADER_PROCON_CHECK);
  Fls0WOPCheck = (uint32)(FLASH0_PROCONWOP0.U & FLSLOADER_PROCON_CHECK);
  #endif

  if ((Fls0Check == FLSLOADER_PROCON_CHECK) ||
      (Fls0WOPCheck == FLSLOADER_PROCON_CHECK))
  {
    RetError = FLSLOADER_E_ROMVERSION;
  }
  return (RetError);
}

/*******************************************************************************
** Syntax :           IFX_LOCAL_INLINE uint32 FlsLoader_lSectorNumber(        **
**                      uint32 Offset                                         **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : offset: PFLASH0 Offset address                          **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : SectorNumber                                            **
**                                                                            **
** Description      : This function will return the sector number             **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 FlsLoader_lSectorNumber(uint32 Offset)
{
  uint32 SectorNumber;
  for(SectorNumber = 0U;
      SectorNumber < FLSLOADER_NUM_OF_PF0_SECTORS;
      SectorNumber++)
  {
    if(FlsLoader_PFlashSectorOffset[SectorNumber] == Offset)
    {
      break;
    }
  }
 if(SectorNumber == FLSLOADER_NUM_OF_PF0_SECTORS)
  {
    SectorNumber = FLSLOADER_INV;
  }
  return (SectorNumber);
}

#define FLSLOADER_STOP_SEC_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

#define FLSLOADER_START_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

#if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
/*******************************************************************************
** Syntax             FlsLoader_ReturnType FlsLoader_lWriteDetCheck(          **
**                      FlsLoader_LengthType Length,                          **
**                      FlsLoader_AddressType TargetAddress                   **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : Length :Length of the data                              **
**                    TargetAddress :Destination Address in Flash             **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : RetError                                                **
**                                                                            **
** Description      : This function is DET Check function for                 **
**                    FlsLoader_lWrite                                        **
*******************************************************************************/
FlsLoader_ReturnType FlsLoader_lWriteDetCheck(FlsLoader_LengthType Length,
                                           FlsLoader_AddressType TargetAddress)
{
  uint8                     ErrorHook;
  FlsLoader_ReturnType      RetError;
  FlsLoader_LengthType      TargetEnd;
  /* Init RetError to OK */
  RetError = FLSLOADER_E_OK;

  /* check for Init DET */
  if (FlsLoader_InitStatus != FLSLOADER_INITIALIZED)
  {
    /* CD_FlsLoader034 :Report missing initialization DET */
    Det_ReportError(FLSLOADER_MODULE_ID,
                    FLSLOADER_INSTANCE_ID,
                    FLSLOADER_SID_WRITE,
                    FLSLOADER_E_UNINIT);
    RetError = FLSLOADER_E_NOT_OK;
  }
  /* Check of TargetAddress
  TargetAddress can be multiple of 256 bytes in caseof PFLASH or 32 bytes.
  incase of DFLASH. */
  /* Report Invalid TargetAddress to DET */
  if ( RetError != FLSLOADER_E_NOT_OK)
  {
    ErrorHook = FlsLoader_lAddressPageCheck(TargetAddress);
    if  (0U == ErrorHook)
    {
      Det_ReportError(FLSLOADER_MODULE_ID,
                      FLSLOADER_INSTANCE_ID,
                      FLSLOADER_SID_WRITE,
                      FLSLOADER_E_PARAM_ADDRESS);
      RetError = FLSLOADER_E_NOT_OK;
    }
  }

  if ( RetError != FLSLOADER_E_NOT_OK)
  {
    /* Returns true if, position is DFLASH address */
    if (FlsLoader_lCheckFlashType(TargetAddress))
    {
      /* Given TargetAddress and Length should not exceed the flash boundary */
      /* Its Data Flash assign,Report invalid Length to DET */
      if (FlsLoader_lDFlashPageCheck(TargetAddress,Length))
      {
        Det_ReportError(FLSLOADER_MODULE_ID,
                        FLSLOADER_INSTANCE_ID,
                        FLSLOADER_SID_WRITE,
                        FLSLOADER_E_PARAM_LENGTH);
        RetError = FLSLOADER_E_NOT_OK;
      }
    }
    else /*PFlash*/
    {
      TargetEnd = (Length + TargetAddress)-1U;
      /*PFLASH0*/
      if ((Length == (FlsLoader_LengthType)0U) ||
         ((Length & ((FlsLoader_LengthType)FLSLOADER_MOD_32)) != 0U))
      {
        Det_ReportError(FLSLOADER_MODULE_ID,
                        FLSLOADER_INSTANCE_ID,
                        FLSLOADER_SID_WRITE,
                        FLSLOADER_E_PARAM_LENGTH);
        RetError = FLSLOADER_E_NOT_OK;
      }
      else if(TargetEnd > (FlsLoader_LengthType)FLSLOADER_PFLASH0_END)
      {
        Det_ReportError(
                        FLSLOADER_MODULE_ID,
                        FLSLOADER_INSTANCE_ID,
                        FLSLOADER_SID_WRITE,
                        FLSLOADER_E_PARAM_LENGTH);
        RetError = FLSLOADER_E_NOT_OK;
      }
      else
      {
        /* dummy else */
      }
    }
  }
  return (RetError);
}
/*******************************************************************************
** Syntax           :  FlsLoader_ReturnType FlsLoader_lEraseDetCheck(         **
**                      FlsLoader_LengthType Length,                          **
**                      FlsLoader_AddressType TargetAddress                   **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : Length :Length of the data                              **
**                    TargetAddress :Destination Address in Flash             **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : RetError                                                **
**                                                                            **
** Description      : This function is DET Check  for FlsLoader_Erase         **
*******************************************************************************/
FlsLoader_ReturnType FlsLoader_lEraseDetCheck(
                                      FlsLoader_LengthType Length,
                                      FlsLoader_AddressType TargetAddress)
{
  FlsLoader_ReturnType  RetError;
  uint32                Offset;
  uint32                SectorNumber;
  uint8                 ErrorHook;

