sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/flsloader_infineon_tricore/src/FlsLoader_Platform.c
  RetError = FLSLOADER_E_OK;
  
  if (FlsLoader_InitStatus != FLSLOADER_INITIALIZED)
  {
    /* CD_FlsLoader039: Report missing initilization to DET */
    Det_ReportError(FLSLOADER_MODULE_ID,
                    FLSLOADER_INSTANCE_ID,
                    FLSLOADER_SID_ERASE,
                    FLSLOADER_E_UNINIT);
    RetError = FLSLOADER_E_NOT_OK;
  }
  else
  {
    /* CD_FlsLoader041: Report invalid TargetAddress to DET */
    if (FlsLoader_lCheckFlashType(TargetAddress))
    { /* Check for DFLASH Address*/
      if (FlsLoader_lDFlashCheck(TargetAddress))
      {
        ErrorHook = FlsLoader_lDFlashAddressCheck(TargetAddress);
        if  (0U == ErrorHook)
        {
          Det_ReportError(FLSLOADER_MODULE_ID,
                          FLSLOADER_INSTANCE_ID,
                          FLSLOADER_SID_ERASE,
                          FLSLOADER_E_PARAM_ADDRESS);
          RetError = FLSLOADER_E_NOT_OK;
        }
      }
      if (RetError != FLSLOADER_E_NOT_OK)
      {
        ErrorHook = FlsLoader_lDFlashLengthCheck(Length,TargetAddress);
        if(0U == ErrorHook)
        {
          Det_ReportError(FLSLOADER_MODULE_ID,
                          FLSLOADER_INSTANCE_ID,
                          FLSLOADER_SID_ERASE,
                          FLSLOADER_E_PARAM_LENGTH);
          RetError = FLSLOADER_E_NOT_OK;
        }
      }
    }
    else
    {
      /* Check for PFLASH Address.*/
        /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
        volatile uint32 to avoid compiler optimization in command cycles*/
      if(TargetAddress < FLSLOADER_PFLASH0_START_ADDRESS)
      {
        Det_ReportError(FLSLOADER_MODULE_ID,
                        FLSLOADER_INSTANCE_ID,
                        FLSLOADER_SID_ERASE,
                        FLSLOADER_E_PARAM_ADDRESS);
        RetError = FLSLOADER_E_NOT_OK;
      }
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
        volatile uint32 to avoid compiler optimization in command cycles*/
      else if(TargetAddress > FLSLOADER_PFLASH0_END)
      {
        Det_ReportError(FLSLOADER_MODULE_ID,
                      FLSLOADER_INSTANCE_ID,
                      FLSLOADER_SID_ERASE,
                      FLSLOADER_E_PARAM_ADDRESS);
        RetError = FLSLOADER_E_NOT_OK;
      }
      else
      {
        ErrorHook = FlsLoader_lPFlashAddressCheck(TargetAddress);
        if  (0U == ErrorHook)
        {
          Det_ReportError(FLSLOADER_MODULE_ID,
                          FLSLOADER_INSTANCE_ID,
                          FLSLOADER_SID_ERASE,
                          FLSLOADER_E_PARAM_ADDRESS);
          RetError = FLSLOADER_E_NOT_OK;
        }
      }
      if (RetError != FLSLOADER_E_NOT_OK)
      {
        /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
        volatile uint32 to avoid compiler optimization in command cycles*/
        Offset = TargetAddress - FLSLOADER_PFLASH0_START_ADDRESS;
        SectorNumber = FlsLoader_lSectorNumber(Offset);
        if ((Length == 0U)||
           ((SectorNumber + Length) > FLSLOADER_NUM_OF_PF0_SECTORS))
        {
          Det_ReportError(FLSLOADER_MODULE_ID,
                          FLSLOADER_INSTANCE_ID,
                          FLSLOADER_SID_ERASE,
                          FLSLOADER_E_PARAM_LENGTH);
          RetError = FLSLOADER_E_NOT_OK;
        }
      }
    }
  } /* end of if check FlashType */
  return (RetError);
}
/*******************************************************************************
** Syntax   :   IFX_LOCAL_INLINE uint8 FlsLoader_lAddressPageCheck(           **
**                      FlsLoader_AddressType TargetAddress                   **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : TargetAddress : Address passed                          **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : RetVal                                                  **
**                                                                            **
** Description      : This function returns the give TargetAddress last two   **
**                    nibbles are zero value                                  **
*******************************************************************************/
IFX_LOCAL_INLINE uint8 FlsLoader_lAddressPageCheck(
                                           FlsLoader_AddressType TargetAddress)
{
  uint8     RetVal;
  /* Init ErrorHook to false */
  RetVal = 0U;
  /* Check of TargetAddress
  TargetAddress can be multiple of 256 bytes or 32 bytes. */
  /* CD_FlsLoader036 :Report Invalid TargetAddress to DET */
  if (FlsLoader_lPFlashCheck(TargetAddress))
  {
    /* First byte is already checked, last two nibbles must be zero.*/
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
    volatile uint32 to avoid compiler optimization in command cycles*/
    /*IFX_MISRA_RULE_01_02_STATUS=TargetAddress is defined of type 
    volatile uint32 to avoid compiler optimization in command cycles*/
    if ((TargetAddress & (FlsLoader_AddressType)FLSLOADER_MOD_32) == 
                                                          FLSLOADER_POSITION_0 )
    {
      RetVal = 1U; /* valid sector Address */
    }
  }
  else
  {
    if (FlsLoader_lDFlashCheck(TargetAddress))
    {
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
      volatile uint32 to avoid compiler optimization in command cycles*/
      /*IFX_MISRA_RULE_01_02_STATUS=TargetAddress is defined of type 
      volatile uint32 to avoid compiler optimization in command cycles*/
      if ( (TargetAddress & (FlsLoader_AddressType)FLSLOADER_MOD_8) == 
                                                          FLSLOADER_POSITION_0 )
      {
        RetVal = 1U;
      }
    }
  } /* end of if TargetAddress check */
  return (RetVal);
}
/*******************************************************************************
** Syntax           :  IFX_LOCAL_INLINE boolean FlsLoader_lDFlashCheck(       **
**                                       FlsLoader_AddressType TargetAddress) **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : TargetAddress : Address passed                          **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : RetVal                                                  **
**                                                                            **
** Description      : Checks that TargetAddress is within DFLASH Address Range**
*******************************************************************************/
IFX_LOCAL_INLINE boolean FlsLoader_lDFlashCheck(
                         FlsLoader_AddressType TargetAddress)
{
  boolean RetVal;
  RetVal  = FALSE;

  /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
  volatile uint32 to avoid compiler optimization in command cycles*/
  if(TargetAddress >= FLSLOADER_DFLASH0_START_ADDRESS)
  {
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
    volatile uint32 to avoid compiler optimization in command cycles*/
    if(TargetAddress <= FLSLOADER_DFLASH0_END)
    {
      RetVal = TRUE;
    }
  }
  /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
  volatile uint32 to avoid compiler optimization in command cycles*/
  if(TargetAddress >= FLSLOADER_UCB_START_ADDRESS)
  {
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
    volatile uint32 to avoid compiler optimization in command cycles*/
    if(TargetAddress <= FLSLOADER_UCB_END_ADDRESS)
    {
      RetVal = TRUE;
    }
  }
  return (RetVal);
}

