sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/flsloader_infineon_tricore/src/FlsLoader_Platform.c
/*******************************************************************************
** Syntax   :   IFX_LOCAL_INLINE uint8 FlsLoader_lDFlashAddressCheck(         **
**                      FlsLoader_AddressType TargetAddress                   **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : TargetAddress : Address passed                          **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : RetVal                                                  **
**                                                                            **
** Description      : This function returns if the given TargetAddress        **
**                    matches the start of DF_EEPROM or DF_UCB sector address **
*******************************************************************************/
IFX_LOCAL_INLINE uint8 FlsLoader_lDFlashAddressCheck(
                                           FlsLoader_AddressType TargetAddress)
{
  uint16               DfSegment;
  uint8                RetVal;
  RetVal = 0U;
  DfSegment = (uint16)(TargetAddress >> FLSLOADER_SHIFT_BY_20);
  if (DfSegment == FLSLOADER_DF_EEPROM_SEGMENT)
  {
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
    type volatile uint32 to avoid compiler optimization in 
    command cycles*/
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
    type volatile uint32 to avoid compiler optimization in 
    command cycles*/
    if ((TargetAddress & (FlsLoader_AddressType)FLSLOADER_EEPROM_SECTOR_SIZE) 
        == FLSLOADER_POSITION_0)
    {
      RetVal = 1U; /*Valid DF_EEPROM Start Sector Address */
    }
  }
  if (DfSegment == FLSLOADER_DF_UCB_SEGMENT)
  {
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
    type volatile uint32 to avoid compiler optimization in 
    command cycles*/
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
    type volatile uint32 to avoid compiler optimization in 
    command cycles*/
    if ((TargetAddress & (FlsLoader_AddressType)FLSLOADER_UCB_SECTOR_SIZE_1) 
        == FLSLOADER_POSITION_0)
    {
      RetVal = 1U; /*Valid DF_UCB Start Sector Address */
    }
  }
  return (RetVal);
}
/*******************************************************************************
** Syntax   :   IFX_LOCAL_INLINE uint8 FlsLoader_lDFlashLengthCheck(          **
**                      FlsLoader_LengthType Length,                          **
**                      FlsLoader_AddressType TargetAddress                   **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : TargetAddress : Address passed                          **
**                    Length        : Length of the data                      **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : RetVal                                                  **
**                                                                            **
** Description      : This function returns if the given Length               **
**                    is within DF_EEPROM or DF_UCB range                     **
*******************************************************************************/
IFX_LOCAL_INLINE uint8 FlsLoader_lDFlashLengthCheck(
               FlsLoader_LengthType Length,FlsLoader_AddressType TargetAddress)
{
  uint32               DFLengthCheck;
  uint16               DfSegment;
  uint8                RetVal;
  
  RetVal = 1U;
  DfSegment = (uint16)(TargetAddress >> FLSLOADER_SHIFT_BY_20);
  if (Length == 0U)
  {
    RetVal = 0U;
  }
  if (DfSegment == FLSLOADER_DF_EEPROM_SEGMENT)
  {
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
    type volatile uint32 to avoid compiler optimization in 
    command cycles*/
    DFLengthCheck = ((uint32)(TargetAddress + (FlsLoader_AddressType)
                            (Length * FLSLOADER_DFLASH_SECTOR_SIZE)))-1U;
    if (( DFLengthCheck > FLSLOADER_DFLASH0_END ) || 
        ( Length > FLSLOADER_NUM_OF_DF_SECTORS ))
    {
      RetVal = 0U; /*InValid DF_EEPROM Sector Length */
    }
  }
  if (DfSegment == FLSLOADER_DF_UCB_SEGMENT)
  {
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
    type volatile uint32 to avoid compiler optimization in 
    command cycles*/
    DFLengthCheck = ((uint32)(TargetAddress + (FlsLoader_AddressType)
                            (Length * FLSLOADER_UCB_SECTOR_SIZE)))-1U;
    if (( DFLengthCheck > FLSLOADER_UCB_END_ADDRESS ) ||
        ( Length > FLSLOADER_NUM_OF_UCB_SECTORS ))
    {
      RetVal = 0U; /*InValid DF_EEPROM Sector Length */
    }    
  }
  return (RetVal);
}

