sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/flsloader_infineon_tricore/src/FlsLoader_Platform.c
/*******************************************************************************
** Syntax           :  IFX_LOCAL_INLINE boolean FlsLoader_lPFlashCheck(       **
**                                       FlsLoader_AddressType TargetAddress) **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : TargetAddress : Address passed                          **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint8: RetVal                                           **
**                                                                            **
** Description      :Checks that TargetAddress is within PFLASH Address Range **
*******************************************************************************/
IFX_LOCAL_INLINE boolean FlsLoader_lPFlashCheck(
                         FlsLoader_AddressType TargetAddress)
{
  boolean RetVal;
  RetVal = FALSE;
  /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
  volatile uint32 to avoid compiler optimization in command cycles*/
  if(TargetAddress >= FLSLOADER_PFLASH0_START_ADDRESS)
  {
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
    volatile uint32 to avoid compiler optimization in command cycles*/
    if(TargetAddress <= FLSLOADER_PFLASH0_END)
    {
      RetVal = TRUE;
    }
  }
  return (RetVal);
}

/*******************************************************************************
** Syntax   :   IFX_LOCAL_INLINE uint8 FlsLoader_lPFlashAddressCheck(         **
**                      FlsLoader_AddressType TargetAddress                   **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : TargetAddress : Address passed                          **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     :  RetVal                                                 **
**                                                                            **
** Description      : This function returns if the given TargetAddress        **
**                    matches the start PFlash sector start address           **
*******************************************************************************/
IFX_LOCAL_INLINE uint8 FlsLoader_lPFlashAddressCheck(
                                           FlsLoader_AddressType TargetAddress)
{
  uint8                RetVal;
  uint32               Offset;
  uint32               SectorNumber;
  RetVal = 1U;

  /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
  type volatile uint32 to avoid compiler optimization in 
  command cycles*/
  Offset = TargetAddress - FLSLOADER_PFLASH0_START_ADDRESS ;

  for(SectorNumber = 0U; SectorNumber < FLSLOADER_NUM_OF_PF0_SECTORS;
      SectorNumber++)
  {
    if (FlsLoader_PFlashSectorOffset[SectorNumber] == Offset)
    {
      break;
    }
  }
  if (SectorNumber == FLSLOADER_NUM_OF_PF0_SECTORS)
  {
    RetVal = 0U;
  }
  return (RetVal);
}
/*******************************************************************************
** Syntax           :  IFX_LOCAL_INLINE boolean FlsLoader_lDFlashPageCheck(   **
**                                       FlsLoader_AddressType TargetAddress, **
                                         FlsLoader_LengthType Length )        **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : TargetAddress, Length                                   **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : boolean                                                 **
**                                                                            **
** Description      : Checks the length for DFlash operation                  **
*******************************************************************************/
IFX_LOCAL_INLINE boolean FlsLoader_lDFlashPageCheck(
                FlsLoader_AddressType TargetAddress,FlsLoader_LengthType Length)
{
  boolean                   RetVal;
  uint16                    DfSegment;
  FlsLoader_LengthType      TargetEnd;
  RetVal = FALSE;
   
  if ((Length) == (FlsLoader_LengthType)0U)
  {
    RetVal = TRUE;
  }
  if (((Length) & ((FlsLoader_LengthType)FLSLOADER_MOD_8)) != 0U)
  {
    RetVal = TRUE;
  }
  DfSegment = (uint16)(TargetAddress >> FLSLOADER_SHIFT_BY_20);
  /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
  volatile uint32 to avoid compiler optimization in command cycles*/
  TargetEnd = (Length + (TargetAddress & FLSLOADER_ADDRESS_MASK)) - 1U ;
  if (DfSegment == FLSLOADER_DF_EEPROM_SEGMENT)
  {
    if ((TargetEnd > (FlsLoader_LengthType)FLSLOADER_EEPROM_OFFSETEND) ||
        (Length > FLSLOADER_DFLASH_BANK_SIZE))
    {
      RetVal = TRUE;
    }
  }
  if (DfSegment == FLSLOADER_DF_UCB_SEGMENT)
  {
    if ((TargetEnd > (FlsLoader_LengthType)FLSLOADER_UCB_OFFSETEND) ||
        (Length > FLSLOADER_UCBSIZE))
    {
      RetVal = TRUE;
    }
  }
  return (RetVal);
}
#endif /* #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON) */

