sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/flsloader_infineon_tricore/src/FlsLoader_Platform.c
/*******************************************************************************
** Syntax           :  uint32 FlsLoader_lGetFlashType(                        **
**                                       FlsLoader_AddressType TargetAddress) **
                                                                              **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : TargetAddress                                           **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32 FlashType                                        **
**                                                                            **
** Description      : Checks the whether Flash is DFlash or Pflash            **
*******************************************************************************/
uint32 FlsLoader_lGetFlashType(FlsLoader_AddressType TargetAddress)
{
  /* With WINDRIVER 5.9.4.8 + Patch TCDIAB-13823 some issues were observed 
  with variable optimisation , "volatile" is used to address this issue.*/
  volatile uint32 Flash_Type; 
  
  if (FlsLoader_lCheckFlashType(TargetAddress))
  {
    /* Given Address belongs to DFLASH */
    /* Data Flash Bank 0 or Bank 1 is assigned */
    Flash_Type = FLSLOADER_DFLASH_BANK0;
  }
  else
  {
    /* Given Address belongs to PFLASH */
    /* Program Flash Bank 0 or Bank 1 is assigned */
    Flash_Type = FLSLOADER_PFLASH_BANK0;
  }
  return Flash_Type;
}

/*******************************************************************************
** Syntax           :  FlsLoader_ReturnType                                   **
**                     FlsLoader_lFlashLockCheck (                            **
**                                    FlsLoader_AddressType TargetAddress,    **
**                                    uint32 FlashType,                       **
**                                    FlsLoader_LengthType Length)            **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       :  Synchronous                                            **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters (in)  : TargetAddress, FlashType, Length                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : FlsLoader_ReturnType                                    **
**                                                                            **
** Description      : This function will return if the sector is protected    **
**                                                                            **
*******************************************************************************/
#if (FLSLOADER_ENABLE_LOCKCHECK == STD_ON)
FlsLoader_ReturnType FlsLoader_lFlashLockCheck (
                        FlsLoader_AddressType TargetAddress,uint32 FlashType,
                        FlsLoader_LengthType Length)
{
  volatile uint32                FlsFpro;
  volatile uint32                FlsFprod;
  volatile uint32                FlsProconp1;
  volatile uint32                FlsProcond1;
  volatile uint32                FlsProcondrpro1;
  FlsLoader_ReturnType           RetError;
  
  RetError = FLSLOADER_E_OK;
  
  if (FlashType != FLSLOADER_DFLASH_BANK0)
  {
    #ifdef  IFX_FLSLOADER_DEBUG
    FlsFpro = TestFlsloader_DebugMask06;
    #else
    FlsFpro = FLASH0_FPRO.B.PRODISP;
    #endif
    if (FlsFpro != 1U)
    {
      #ifdef  IFX_FLSLOADER_DEBUG
      FlsProconp1 = TestFlsloader_DebugMask09;
      #else
      FlsProconp1 = FLASH0_PROCONP0.B.RPRO;
      #endif
      if (FlsProconp1 == 1U)
      {
        RetError = FLSLOADER_E_LOCKED;
      }
      else
      {
        RetError = FlsLoader_lPFlashSectorCheck(TargetAddress,Length);
      }
    }
  }
  else
  {
    /*Check if global write protection is installed in DFLASH*/
    #ifdef  IFX_FLSLOADER_DEBUG
    FlsFprod =  TestFlsloader_DebugMask09;
    FlsProcond1 =  TestFlsloader_DebugMask06;
    FlsProcondrpro1 = TestFlsloader_DebugMask06;
    #else
    FlsFprod = FLASH0_FPRO.B.PRODISD;
    FlsProcond1 = FLASH0_PROCOND.B.L;
    FlsProcondrpro1 = FLASH0_PROCOND.B.RPRO;
    #endif
    if(FlsFprod != 1U)
    {
      if(FlsProcond1 == 1U)
      {
        RetError = FLSLOADER_E_LOCKED;
      }
      if(FlsProcondrpro1 == 1U)
      {
        RetError = FLSLOADER_E_LOCKED;
      }
    }
  }
  return RetError;
}

/*******************************************************************************
** Syntax           :  FlsLoader_ReturnType                                   **
**                     FlsLoader_lPFlashSectorCheck (                         **
**                                       FlsLoader_AddressType TargetAddress, **
**                                       FlsLoader_LengthType Length)         **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters (in)  : TargetAddress, Length                                   **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : FlsLoader_ReturnType                                    **
**                                                                            **
** Description      : This function will return if the sector is protected    **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lPFlashSectorCheck (
                          FlsLoader_AddressType TargetAddress,
                          FlsLoader_LengthType Length)
{
  
  uint32                SectorNumber;
  uint32                SectorNumber1;
  uint32                NoOfSectors;
  uint32                SectorMask;
  uint32                Offset;
  uint32                Offset1;
  volatile uint32       FlsRegProconp0;
  FlsLoader_ReturnType  RetError;
  
