sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/flsloader_infineon_tricore/src/FlsLoader_Platform.c
  RetError = FLSLOADER_E_OK;
  #ifdef  IFX_FLSLOADER_DEBUG
  FlsRegProconp0 = TestFlsloader_DebugMask10;
  #else
  FlsRegProconp0 = FLASH0_PROCONP0.U;
  #endif

  /*IFX_MISRA_RULE_01_02_STATUS=TargetAddress is defined of 
  type volatile uint32 to avoid compiler optimization in command 
  cycles*/
  Offset = TargetAddress - FLSLOADER_PFLASH0_START_ADDRESS;
  for(SectorNumber = 0U;
      SectorNumber < FLSLOADER_NUM_OF_PF0_SECTORS;
      SectorNumber++)
  {
    if(Offset < FlsLoader_PFlashSectorOffset[SectorNumber])
    {
      break;
    }
  }
  SectorNumber--;
  TargetAddress = TargetAddress + Length ;
  /*IFX_MISRA_RULE_01_02_STATUS=TargetAddress is defined of 
  type volatile uint32 to avoid compiler optimization in command 
  cycles*/
  Offset1 = TargetAddress - FLSLOADER_PFLASH0_START_ADDRESS;
  for(SectorNumber1 = 0U;
      SectorNumber1 < FLSLOADER_NUM_OF_PF0_SECTORS;
      SectorNumber1++)
  {
    if(Offset1 < FlsLoader_PFlashSectorOffset[SectorNumber1])
    {
      break;
    }
  }
  NoOfSectors = SectorNumber1 - SectorNumber;
  SectorMask = (((uint32)1U << NoOfSectors) - (uint32)1U) << SectorNumber;
  if((SectorMask & FlsRegProconp0) != 0U)
  {
    RetError = FLSLOADER_E_LOCKED;
  }
  return RetError;
}

/*******************************************************************************
** Syntax           :  FlsLoader_ReturnType                                   **
**                     FlsLoader_lEraseLockCheck (                            **
**                                    FlsLoader_AddressType TargetAddress,    **
**                                    uint32 FlashType,                       **
**                                    FlsLoader_LengthType Length)            **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters (in)  : TargetAddress, FlashType, Length                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : FlsLoader_ReturnType                                    **
**                                                                            **
** Description      : This function will return if the sector is protected    **
**                                                                            **
*******************************************************************************/
FlsLoader_ReturnType FlsLoader_lEraseLockCheck (
                          FlsLoader_AddressType TargetAddress,uint32 FlashType,
                          FlsLoader_LengthType Length)
{
  volatile uint32                FlsFproD;
  volatile uint32                FlsProcond2;
  volatile uint32                FlsProcondrpro2;
  volatile uint32                FlsFpro;
  volatile uint32                FlsProconp2;
  FlsLoader_ReturnType           RetError;
  
  RetError = FLSLOADER_E_OK;
  /* Given Address belongs to Data FLASH */
  /*Check if the Target Address passed is UCB protected */
  /* Check if global write protection is installed in DFLASH*/
  if (FlashType == FLSLOADER_DFLASH_BANK0)
  {
    #ifdef  IFX_FLSLOADER_DEBUG
    FlsFproD =  TestFlsloader_DebugMask09;
    FlsProcond2 =  TestFlsloader_DebugMask06;
    FlsProcondrpro2 =  TestFlsloader_DebugMask06;
    #else
    FlsFproD = FLASH0_FPRO.B.PRODISD;
    FlsProcond2 = FLASH0_PROCOND.B.L;
    FlsProcondrpro2 = FLASH0_PROCOND.B.RPRO;
    #endif
    if (FlsFproD != 1U)
    {
      if(FlsProcond2 == 1U)
      {
        RetError = FLSLOADER_E_LOCKED;
      }
      if(FlsProcondrpro2 == 1U)
      {
        RetError = FLSLOADER_E_LOCKED;
      }
    }
  }
  else
  {
    /*Check if the Target Address passed is UCB protected */
    /* Protection Check Algorithm */
    /* Preprocessor switch to enable/disable the lockcheck functionality */
    /* Check if global write protection is installed */
    #ifdef  IFX_FLSLOADER_DEBUG
    FlsFpro =  TestFlsloader_DebugMask09;
    #else
    FlsFpro = FLASH0_FPRO.B.PRODISP;
    #endif
    if(FlsFpro != 1U)
    {
      #ifdef  IFX_FLSLOADER_DEBUG
      FlsProconp2 =  TestFlsloader_DebugMask06;
      #else
      FlsProconp2 = FLASH0_PROCONP0.B.RPRO;
      #endif
      if (FlsProconp2 == 1U)
      {
        RetError = FLSLOADER_E_LOCKED;
      }
      else
      {
        RetError = FlsLoader_lCheckSectorProt(TargetAddress, Length);
      }
    }
  }
  return RetError;
}

/*******************************************************************************
** Syntax  :          FlsLoader_ReturnType FlsLoader_lCheckSectorProt(        **
**                      uint32 TargetAddress, FlsLoader_LengthType Length)    **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : TargetAddress, Length                                   **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : FlsLoader_ReturnType                                    **
**                                                                            **
** Description      : This function will return if the sector is protected    **
*******************************************************************************/
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lCheckSectorProt(
                                                 uint32 TargetAddress,
                                                 FlsLoader_LengthType Length )
{
  FlsLoader_ReturnType RetError;
  uint32 SectorNumber;
  uint32 Offset;

  Offset = TargetAddress - FLSLOADER_PFLASH0_START_ADDRESS;
  SectorNumber = FlsLoader_lSectorNumber(Offset);
  /* Check if any of the 26 sectors of PF0 are locked for
  write/OTP/WOP protection */
  RetError = FlsLoader_lSectorProtCheck(SectorNumber, Length);

  return RetError;
}

