sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/flsloader_infineon_tricore/src/FlsLoader_Platform.c
/*******************************************************************************
** Syntax           : FlsLoader_ReturnType FlsLoader_lSectorProtCheck(        **
**                      uint32 SectorNumber,                                  **
**                      FlsLoader_LengthType Length )                         **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
**                                                                            **
** Parameters(in)   : SectorNumber, Length                                    **
**                                                                            **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : FlsLoader_ReturnType                                    **
**                                                                            **
** Description      : This function returns sector locked or not.             **
*******************************************************************************/
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lSectorProtCheck(
                                uint32 SectorNumber,FlsLoader_LengthType Length)
{
  FlsLoader_ReturnType RetError;
  uint32               SectorMask;
  uint32               FlsRegProconp0;
  uint32               FlsRegProconWop0;
  uint32               FlsRegProconOtp0;

  /* Init RetError to OK */
  RetError = FLSLOADER_E_OK;

  if(SectorNumber != FLSLOADER_INV)
  {
    #ifdef IFX_FLSLOADER_DEBUG
    FlsRegProconp0 = TestFlsloader_DebugMask10;
    FlsRegProconWop0 = TestFlsloader_DebugMask10;
    FlsRegProconOtp0 = TestFlsloader_DebugMask10;
    #else
    FlsRegProconp0 = FLASH0_PROCONP0.U;
    FlsRegProconWop0 = FLASH0_PROCONWOP0.U;
    FlsRegProconOtp0 = FLASH0_PROCONOTP0.U;

    #endif
      
    SectorMask = (((uint32)1U << Length) - (uint32)1U) << SectorNumber;

    if (((FlsRegProconp0   & SectorMask) != 0U) ||
        ((FlsRegProconOtp0 & SectorMask) != 0U) ||
        ((FlsRegProconWop0 & SectorMask) != 0U))
    {
      RetError = FLSLOADER_E_LOCKED;
    }
  }
  else
  {
    RetError = FLSLOADER_E_NOT_OK;
  }
  
  return (RetError);
}

#endif

#define FLSLOADER_STOP_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives 
  is allowed only for MemMap.h*/
#include "MemMap.h"

